problems.org
#+TITLE: Bootcamp Problems
#+AUTHOR: Natarajan Shankar
#+LANGUAGE: en
#+EXPORT_FILE_NAME: problems.html
#+OPTIONS: toc:2 num:nil

[[file:index.html][Back to main page]]

* Overview

The goal of the Bootcamp is to put the knowledge gained during the summer school to use in solving a big verification problem.

Here's a list of problems that should be solvable in five hours or less with teams of two or three students. Pick the tool of your choice.

You can be as abstract or concrete as you wish, but you get more points if you have efficiently executable code. Feel free to attempt more than one problem.

* Recommended Tools

Some recommendations include:

1. Dafny ([[https://github.com/dafny-lang/dafny]])
2. Viper ([[https://www.pm.inf.ethz.ch/research/viper.html]])
3. Why3 ([[https://why3.lri.fr/]])
4. CBMC ([[https://www.cprover.org/cbmc/]])
5. Creusot ([[https://github.com/xldenis/creusot]])
6. SeaHorn ([[https://seahorn.github.io/]])
7. Frama-C ([[https://frama-c.com/]])
8. Symbolic Pathfinder ([[https://github.com/SymbolicPathFinder/jpf-symbc]])
9. Coq ([[https://coq.inria.fr/]])
10. Isabelle/HOL ([[https://isabelle.in.tum.de/overview.html]])
11. LEAN ([[https://leanprover.github.io/]])
12. SAL/SALLY ([[http://sal.csl.sri.com]], [[https://sri-csl.github.io/sally/]])
13. PVS ([[http://pvs.csl.sri.com]], get VSCode-PVS from VSCode Marketplace)
14. UCLID5 ([[https://github.com/uclid-org/uclid]])
15. Scallop ([[https://scallop-lang.github.io/ssft22/index.html]])
16. CVC5 ([[https://cvc5.github.io/]])
17. Yices ([[http://yices.csl.sri.com]])
18. Z3 ([[https://github.com/Z3Prover/z3]])
19. Alloy ([[https://alloytools.org]])

* Problems

** Verifying Bit Twiddling Hacks (via Randy Bryant) (Medium)

The CBMC project developed a verifier for C programs based on Bounded Model Checking. The idea is to symbolically simulate the program, using only bounded unrollings of loops and bounded recursions. The program converts C code into a low-level bit representation by "bit blasting." It then calls a SAT solver to check whether the desired property (typically specified as an assertion in the program) holds by showing that the Boolean formula encoding its negation is unsatisfiable.

CBMC can be obtained at: [[https://www.cprover.org/cbmc/]].

Here's an example of a simple C program that verifies that a tricky way of implementing absolute value, matches a "reference version" i.e., a version that can serve as the specification:

#+BEGIN_SRC c
int abs_ref(int x) {

    return x < 0 ? -x : x;

}

int abs_bits(int x) {

  int m = x>>31;

  return (x^m) + ~m + 1;
}

int main() {

    int t = rand();

    int ar = abs_ref(t);

    int ab = abs_bits(t);

    int err = ar != ab;

    assert(!err);

}
#+END_SRC

Here's an interesting application of CBMC: In the early 2000s, Sean Anderson, a Stanford PhD student, published a website with "bit twiddling hacks" It's still available at: [[https://graphics.stanford.edu/~seander/bithacks.html]]

This website gathered a collection of clever tricks people had devised over the years to implement standard operations using low-level bit manipulation tricks. Back in 2005, Bryant checked out the entire collection by translating Anderson's code into a series of functions, writing reference versions of them, and then using his own bit-blasting verifier based on BDDs. The following file contains both Anderson's code and the reference functions: [[https://github.com/rebryant/unsat-tutorial/blob/main/project/bryant-bit-hack-2005.c]]

It would be interesting to try verifying these functions with CBMC. There will be cases where SAT solvers work very well, but others where they scale exponentially. Also, it would be good to verify the functions that Anderson added after 2005.

** Normal Forms (Medium)

Define a representation for Boolean formulas constructed from Boolean variables using negation, implication, disjunction, and conjunction. Transform Boolean formulas to Conjunctive Normal Form. Prove that the transformation preserves satisfiability. See if you can do this as an inference system so that you go from a single formula to a set of clauses. For example, if the formula you are checking for satisfiability is say \((p\wedge q) \vee (\neg q \wedge r)\) becomes \(u = v\vee w, w = p\wedge q, x = \neg q \wedge r\), which can be expanded as \(\neg u \vee v \vee w, u \vee \neg v, u \vee \neg w, \neg w \vee p, \neg w \vee q, \neg p \vee \neg q \vee w, \neg x \vee \neg q, \neg x \vee r, q \vee \neg r \vee x\). Your code should be verified and executable.

** A Checker for Resolution Proofs (Easy)

Write a checker for Resolution proofs and show prove its soundness: if there is a proof of \(\bot\), then the original input clause set is unsatisfiable.

