problems.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- Generated from Org source -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Bootcamp Problems</title>
<meta name="author" content="Natarajan Shankar" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="style.css" />

</head>
<body>
<main id="content" class="content">
<header>
<h1 class="title">Bootcamp Problems</h1>
</header><nav id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orga6ff300">Overview</a></li>
<li><a href="#orgae916df">Recommended Tools</a></li>
<li><a href="#org649879b">Problems</a>
<ul>
<li><a href="#orgfe5fce2">Verifying Bit Twiddling Hacks (via Randy Bryant) (Medium)</a></li>
<li><a href="#org2ded6e8">Normal Forms (Medium)</a></li>
<li><a href="#org21a839a">A Checker for Resolution Proofs (Easy)</a></li>
<li><a href="#org112f3ca">Interpolation from Resolution Proofs (Easy)</a></li>
<li><a href="#orga354635">Boolean constraint propagation with two-watched literals (Hard)</a></li>
<li><a href="#org6ad2627">CDCL SAT solver (Hard)</a></li>
<li><a href="#orgf952984">Database Join (Easy)</a></li>
<li><a href="#orga2983cb">Shortest Path Algorithm (Medium)</a></li>
<li><a href="#orgf7b0dfd">Floyd&#x2013;Warshall Algorithm for All-Pairs Shortest Path (Hard)</a></li>
<li><a href="#orge53ea99">Model Checking BMP/8N1 protocols (Medium)</a></li>
<li><a href="#orgcea425d">Soundness of Separation Hoare Logic (Medium)</a></li>
<li><a href="#orgc7eecbc">MaxSeg Sum (Medium)</a></li>
<li><a href="#org9bae798">Sorting Algorithms (Medium)</a></li>
<li><a href="#org71eee25">IF-Normalization (Easy)</a></li>
<li><a href="#org7156599">BDD Construction (Hard)</a></li>
<li><a href="#org827027f">Checker for RUP proofs (Medium)</a></li>
<li><a href="#orgea8c107">Checking Stratification</a></li>
<li><a href="#org360b200">Simple Concurrency Problem</a></li>
<li><a href="#org1727a5a">Brzozowski Derivatives</a></li>
<li><a href="#org5b676be">Two-Process Bakery Algorithm using Predicate Abstraction</a></li>
<li><a href="#orge402e0f">Interval Analysis by Abstract Interpretation</a></li>
</ul>
</li>
</ul>
</div>
</nav>
<p>
<a href="index.html">Back to main page</a>
</p>

<div id="outline-container-orga6ff300" class="outline-2">
<h2 id="orga6ff300">Overview</h2>
<div class="outline-text-2" id="text-orga6ff300">
<p>
The goal of the Bootcamp is to put the knowledge gained during the summer school to use in solving a big verification problem.
</p>

<p>
Here&rsquo;s a list of problems that should be solvable in five hours or less with teams of two or three students. Pick the tool of your choice.
</p>

<p>
You can be as abstract or concrete as you wish, but you get more points if you have efficiently executable code. Feel free to attempt more than one problem.
</p>
</div>
</div>

<div id="outline-container-orgae916df" class="outline-2">
<h2 id="orgae916df">Recommended Tools</h2>
<div class="outline-text-2" id="text-orgae916df">
<p>
Some recommendations include:
</p>

<ol class="org-ol">
<li>Dafny (<a href="https://github.com/dafny-lang/dafny">https://github.com/dafny-lang/dafny</a>)</li>
<li>Viper (<a href="https://www.pm.inf.ethz.ch/research/viper.html">https://www.pm.inf.ethz.ch/research/viper.html</a>)</li>
<li>Why3 (<a href="https://why3.lri.fr/">https://why3.lri.fr/</a>)</li>
<li>CBMC (<a href="https://www.cprover.org/cbmc/">https://www.cprover.org/cbmc/</a>)</li>
<li>Creusot (<a href="https://github.com/xldenis/creusot">https://github.com/xldenis/creusot</a>)</li>
<li>SeaHorn (<a href="https://seahorn.github.io/">https://seahorn.github.io/</a>)</li>
<li>Frama-C (<a href="https://frama-c.com/">https://frama-c.com/</a>)</li>
<li>Symbolic Pathfinder (<a href="https://github.com/SymbolicPathFinder/jpf-symbc">https://github.com/SymbolicPathFinder/jpf-symbc</a>)</li>
<li>Coq (<a href="https://coq.inria.fr/">https://coq.inria.fr/</a>)</li>
<li>Isabelle/HOL (<a href="https://isabelle.in.tum.de/overview.html">https://isabelle.in.tum.de/overview.html</a>)</li>
<li>LEAN (<a href="https://leanprover.github.io/">https://leanprover.github.io/</a>)</li>
<li>SAL/SALLY (<a href="http://sal.csl.sri.com">http://sal.csl.sri.com</a>, <a href="https://sri-csl.github.io/sally/">https://sri-csl.github.io/sally/</a>)</li>
<li>PVS (<a href="http://pvs.csl.sri.com">http://pvs.csl.sri.com</a>, get VSCode-PVS from VSCode Marketplace)</li>
<li>UCLID5 (<a href="https://github.com/uclid-org/uclid">https://github.com/uclid-org/uclid</a>)</li>
<li>Scallop (<a href="https://scallop-lang.github.io/ssft22/index.html">https://scallop-lang.github.io/ssft22/index.html</a>)</li>
<li>CVC5 (<a href="https://cvc5.github.io/">https://cvc5.github.io/</a>)</li>
<li>Yices (<a href="http://yices.csl.sri.com">http://yices.csl.sri.com</a>)</li>
<li>Z3 (<a href="https://github.com/Z3Prover/z3">https://github.com/Z3Prover/z3</a>)</li>
<li>Alloy (<a href="https://alloytools.org">https://alloytools.org</a>)</li>
</ol>
</div>
</div>

<div id="outline-container-org649879b" class="outline-2">
<h2 id="org649879b">Problems</h2>
<div class="outline-text-2" id="text-org649879b">
</div>
<div id="outline-container-orgfe5fce2" class="outline-3">
<h3 id="orgfe5fce2">Verifying Bit Twiddling Hacks (via Randy Bryant) (Medium)</h3>
<div class="outline-text-3" id="text-orgfe5fce2">
<p>
The CBMC project developed a verifier for C programs based on Bounded Model Checking. The idea is to symbolically simulate the program, using only bounded unrollings of loops and bounded recursions. The program converts C code into a low-level bit representation by &ldquo;bit blasting.&rdquo; It then calls a SAT solver to check whether the desired property (typically specified as an assertion in the program) holds by showing that the Boolean formula encoding its negation is unsatisfiable.
</p>

<p>
CBMC can be obtained at: <a href="https://www.cprover.org/cbmc/">https://www.cprover.org/cbmc/</a>.
</p>

<p>
Here&rsquo;s an example of a simple C program that verifies that a tricky way of implementing absolute value, matches a &ldquo;reference version&rdquo; i.e., a version that can serve as the specification:
</p>

<div class="org-src-container">
<pre class="src src-c">int abs_ref(int x) {

    return x &lt; 0 ? -x : x;

}

int abs_bits(int x) {

  int m = x&gt;&gt;31;

  return (x^m) + ~m + 1;
}

int main() {

    int t = rand();

    int ar = abs_ref(t);

    int ab = abs_bits(t);

    int err = ar != ab;

    assert(!err);

}
</pre>
</div>

<p>
Here&rsquo;s an interesting application of CBMC: In the early 2000s, Sean Anderson, a Stanford PhD student, published a website with &ldquo;bit twiddling hacks&rdquo; It&rsquo;s still available at: <a href="https://graphics.stanford.edu/~seander/bithacks.html">https://graphics.stanford.edu/~seander/bithacks.html</a>
</p>

<p>
This website gathered a collection of clever tricks people had devised over the years to implement standard operations using low-level bit manipulation tricks. Back in 2005, Bryant checked out the entire collection by translating Anderson&rsquo;s code into a series of functions, writing reference versions of them, and then using his own bit-blasting verifier based on BDDs. The following file contains both Anderson&rsquo;s code and the reference functions: <a href="https://github.com/rebryant/unsat-tutorial/blob/main/project/bryant-bit-hack-2005.c">https://github.com/rebryant/unsat-tutorial/blob/main/project/bryant-bit-hack-2005.c</a>
</p>

<p>
It would be interesting to try verifying these functions with CBMC. There will be cases where SAT solvers work very well, but others where they scale exponentially. Also, it would be good to verify the functions that Anderson added after 2005.
</p>
</div>
</div>

<div id="outline-container-org2ded6e8" class="outline-3">
<h3 id="org2ded6e8">Normal Forms (Medium)</h3>
<div class="outline-text-3" id="text-org2ded6e8">
<p>
Define a representation for Boolean formulas constructed from Boolean variables using negation, implication, disjunction, and conjunction. Transform Boolean formulas to Conjunctive Normal Form. Prove that the transformation preserves satisfiability. See if you can do this as an inference system so that you go from a single formula to a set of clauses. For example, if the formula you are checking for satisfiability is say \((p\wedge q) \vee (\neg q \wedge r)\) becomes \(u = v\vee w, w = p\wedge q, x = \neg q \wedge r\), which can be expanded as \(\neg u \vee v \vee w, u \vee \neg v, u \vee \neg w, \neg w \vee p, \neg w \vee q, \neg p \vee \neg q \vee w, \neg x \vee \neg q, \neg x \vee r, q \vee \neg r \vee x\). Your code should be verified and executable.
</p>
</div>
</div>

<div id="outline-container-org21a839a" class="outline-3">
<h3 id="org21a839a">A Checker for Resolution Proofs (Easy)</h3>
<div class="outline-text-3" id="text-org21a839a">
<p>
Write a checker for Resolution proofs and show prove its soundness: if there is a proof of \(\bot\), then the original input clause set is unsatisfiable.
</p>
</div>
</div>
