problems.html

<div id="outline-container-org112f3ca" class="outline-3">
<h3 id="org112f3ca">Interpolation from Resolution Proofs (Easy)</h3>
<div class="outline-text-3" id="text-org112f3ca">
<p>
Take the previous proof representation and divide the clause set into blue clauses and red clauses, and write an algorithm to construct an interpolant from a proof of unsatisfiability. The algorithm is described in the Shankar 2009 Computing Surveys article referenced in the Speaking Logic notes and is excerpted below.
</p>

<p>
Let the input clause set \(K\) be partitioned into red clauses \(K_1\) with atoms \(\mathit{atoms}(K_1)\) and blue clauses \(K_2\) with atoms \(\mathit{atoms}(K_2)\). We show that if \(K\) is unsatisfiable, there is a formula (an interpolant) \(I\) such that \(K_1 \supset I\) and \(K_2\wedge I \supset \bot\). Furthermore, \(\mathit{atoms}(I)\subseteq \mathit{atoms}(K_1)\cap \mathit{atoms}(K_2)\).
</p>

<p>
An interpolant \(I_{\Gamma}\) can be constructed for each clause \(\Gamma\) in the proof. The interpolant for the proof is then just \(I_{\bot}\). Each clause \(\Gamma\) in the proof is partitioned into red literals \(\Gamma_1\) and blue literals \(\Gamma_2\), written \(\Gamma_1\vee\Gamma_2\), with \(\mathit{atoms}(\Gamma_2)\subseteq \mathit{atoms}(K_2)\) and \(\mathit{atoms}(\Gamma_1)\cap \mathit{atoms}(K_2) = \emptyset\).
</p>

<p>
The interpolant \(I_{\Gamma}\) has the property that \(K_1\vdash \neg\Gamma_1 \supset I_{\Gamma}\) and \(K_2\vdash I_{\Gamma} \supset \Gamma_2\), where \(\neg\Gamma_1\) is the set of negations of formulas in \(\Gamma_1\).
</p>

<p>
For input clauses \(\Gamma = \Gamma_1\vee \Gamma_2\) in \(K_1\), the interpolant \(I_{\Gamma} = \Gamma_2\). For input clauses \(\Gamma_2\) in \(K_2\), the interpolant is \(\top\). When resolving \(\Gamma'\), \(\Gamma''\) to get \(\Gamma\),
</p>

<ol class="org-ol">
<li>If resolvent \(p\) is in \(\Gamma'_1\) (i.e., \(p\not\in\mathit{atoms}(K_2)\)), then \(I_{\Gamma} = I_{\Gamma'} \vee I_{\Gamma''}\) since \(\neg(p\vee \Gamma'_1) \supset I_{\Gamma'}\supset \Gamma'_2\) and \(\neg(\neg p\vee \Gamma''_1) \supset I_{\Gamma''}\supset \Gamma''_2\).</li>
<li>If resolvent \(p\) is in \(\Gamma'_2\), then \(I_{\Gamma} = I_{\Gamma'} \wedge I_{\Gamma''}\) since \(\neg(\Gamma'_1\vee\Gamma''_2) \supset I_{\Gamma} \supset (p\vee \Gamma'_2)\wedge (\neg p \vee \Gamma''_2)\supset \Gamma'_2\vee \Gamma''_2\).</li>
</ol>

<p>
The interpolant for input clause sets \(K_1 = \{a\vee e [e], \neg a \vee b [b], \neg a \vee c [c] \}\) and \(K_2 = \{\neg b \vee \neg c \vee d [\top], \neg d [\top], \neg e [\top]\}\), with shared atoms \(b, c,\) and \(e\) can be derived by the following resolution steps.
</p>

<p>
\[
</p>
\begin{array}{|l|l|}\hline
 a & [e] \\\hline
 b & [e \vee b] \\\hline
c  & [e\vee c] \\\hline
\neg c \vee d & [e\vee b] \\\hline
d & [(e\vee b)\wedge (e\vee c)] \\\hline
\bot & [(e\vee b)\wedge (e\vee c)] \\\hline
 \end{array}
<p>
\]
</p>
</div>
</div>

<div id="outline-container-orga354635" class="outline-3">
<h3 id="orga354635">Boolean constraint propagation with two-watched literals (Hard)</h3>
<div class="outline-text-3" id="text-orga354635">
<p>
BCP is a step in the CDCL SAT solving algorithm. See <a href="https://ssft-sri.github.io/old/2017/SSFT-Heule1.pdf">Marijn Heule&rsquo;s 2017 lectures</a> for details. Variables \(V\) are positive integers \(2^{15}\). You are given a set \(K\) of \(k\) (below \(2^{16}\)) clauses in the variables \(V\). This can be represented as an array with index below \(2^{16}\) and range that is a finite sequence of clauses. The state consists of a partial assignment \(M\) mapping \(V\) to pairs of truth values and together with the decision level, where the truth value is a Boolean and the decision level is below \(2^{15}\). For each newly added assignment \(\{v \mapsto b\}\) for \(b \in \{ \mathbf{true}, \mathbf{false}\}\) to \(M\), BCP propagates the assignment through the clauses where \(v\) is a watched variable with the opposite polarity to its assignment, i.e., if \(b\) is \(\mathbf{true}\), then the value is propagated through clauses where \(\neg v\) is watched, and if \(b\) is \(\mathbf{false}\), it is propagated through clauses where \(v\) is watched. Each clause has two watched literals, and these literals must be distinct if the clause contains at least two literals, and must either both be unassigned unless there is only one unassigned literal in the clause, in which case, this literal must be watched and the other literal can be assigned (e.g., by an assignment that has not yet been propagated).
</p>

<p>
For each variable, maintain two lists of watched clauses, i.e., clauses where a literal in the variable occurs as a watched literal. There is one list \(P\) where the positive literal is watched, and another \(N\) where the negative literal is watched. Lists of clauses are maintained by an array \(W\) that maps each variable to a head clauses where it is watched positively and negatively, respectively, and in each case, whether it is the first or second watched literal. You also maintain arrays KW1 and KW2 for each clause, where KW1 maps the clause index to the index of the first watched literal and the successor clause index in the list, and KW2 maps the clause index to the index of the second watched literal, and the successor in the list. The goal is to propagate a new assignment to these watched literals to either:
</p>

<ol class="org-ol">
<li>Find a conflict clause if the watched literal is the only watched literal in the clause, i.e., the other watched literal has already been falsified. For example, if a variable \(v\) is assigned \(\mathbf{true}\), then the list \(N\) is scanned, and if it is assigned \(\mathbf{false}\), the list \(P\) is scanned.</li>
<li>Pick another unassigned literal in the clause to watch.</li>
<li>Propagate the other watched literal if there is no unwatched, unassigned literal in the clause.</li>
</ol>

<p>
For example, if we set the variable \(v\) to \(\mathbf{true}\), then we identify the head clause for the \(N\) list of the \(v\), and then look at \(W(v)\) to get the index of the head clause \(k = W(v)\).
</p>

<p>
Show that
</p>

<ol class="org-ol">
<li>BCP only introduces literals into the partial assignment that are implied by the existing assignments and the original set of clauses.</li>
<li>BCP does not change the set of satisfying assignments for the input set of clauses.</li>
<li>BCP ensures that the watched literals are both unassigned, or contains the only unassigned literal in the clause, if any.</li>
</ol>
</div>
</div>

<div id="outline-container-org6ad2627" class="outline-3">
<h3 id="org6ad2627">CDCL SAT solver (Hard)</h3>
<div class="outline-text-3" id="text-org6ad2627">
<p>
Verify a CDCL SAT solver as an inference system as shown in the Speaking Logic course. You need to verify the termination, soundness, and completeness by showing that the inference system is conservative, progressive, and canonizing. The informal proof is in the notes, but the hard part is in representing the partial assignment to support easy backjumping and in proving termination.
</p>
</div>
</div>

<div id="outline-container-orgf952984" class="outline-3">
<h3 id="orgf952984">Database Join (Easy)</h3>
<div class="outline-text-3" id="text-orgf952984">
<p>
A database consists of a set of tables. Each table consists of rows that assign fields to values. Define a join operation and verify it. To keep things simple, assume that you have an array \(P\) of records with type <code>[# a: uint32, b : uint32 #]</code> and another array \(Q\) of type <code>[# b: uint32, c : uint32 #]</code>, return an array \(PQ\) with element type <code>[# a, b, c: uint32 #]</code> containing all and only those elements <code>(# a := x, b := y, c := z #)</code> where <code>(# a := x, b := y #)</code> is in \(P\) and <code>(# b := y, c := z #)</code> is in \(Q\).
</p>
</div>
</div>
