problems.org
** Shortest Path Algorithm (Medium)

Dijkstra's shortest path algorithm considers a directed graph with non-negative edge-weights and computes the shortest path from a source vertex to all of the vertices. Write and verify Dijkstra's algorithm. To make things a little more explicit, you are given a graph with \(N\) vertices (numbered \(0\) to \(N-1\)) and an \(N\times N\) edge matrix with non-negative (possibly \(\infty\)) weights, and a source vertex is \(s\). You are to construct an array \(P\) of the smallest path weight from \(s\) to each vertex \(t\). Each entry in \(P\) includes the index of a vertex, say \(t\), and the smallest path weight from \(s\) to \(t\). The \(P\) array is partitioned into a prefix with the dead vertices \(D\) and a suffix \(L\) of live vertices organized in a heap. An index \(i\) labels the location of the cursor separating \(D\) from \(L\). As noted in the Speaking Logic slides (117 and 118), the shortest path from \(s\) to any \(t\) is given by a vector \(P\) such that \(P(s) = 0\) and for any \(v\neq s\), \(P(v) = \mathit{min}_u (P(u) + W(u, v))\). For each vertex \(v\) in \(D\), \(P(v)\) is the shortest path. For each vertex \(v\) in \(L\), \(P(v)\) is the shortest path to \(v\) through an edge from \(D\). For the minimal vertex \(v\in L\), no path through an edge from a vertex \(u\) in \(L\) is going to be smaller than \(P(v)\). Hence \(v\) can be moved to \(D\) and the weights of the remaining vertices in \(L\) can be updated to maintain the invariant.

** Floyd--Warshall Algorithm for All-Pairs Shortest Path (Hard)

Verify the Floyd--Warshall algorithm by showing that it contains the shortest path between any two vertices in a weighted directed graph with that does not contain any negative cycles. Alternately, you can show that it computes the shortest cycle-free path. See [[https://en.wikipedia.org/wiki/Floyd_Warshall_algorithm]] for details.

** Model Checking BMP/8N1 protocols (Medium)

Repeat the verification of these protocols by Brown and Pike ([[https://leepike.github.io/pub_pages/bmp.html]]) using SAL.

** Soundness of Separation Hoare Logic (Medium)

The 2022 lectures from Prof. Ruzica Piskac contain the proof rules and semantics for Separation Logic. Formalize the semantics of separation logic and prove that the rules are sound. If you are using a proof assistant, you have the choice of capturing the state of the computation as a mapping \(S\) of variables to (integer and reference) values, and the heap (store) \(M\) as mapping references to arrays containing (integer or reference) values. A heap fragment is just a (possibly empty) subset of references in the domain of the heap. To model separating conjunction \(P * Q\) over a heap fragment \(H\), you need to partition \(H\) into \(H_1\) and \(H_2\) so that \(P\) is an assertion over heap fragment \(H_1\) and \(Q\) is over heap fragment \(H_2\). Recall that the assertions are of the form \(\textit{acc}(r)\), \(P * Q\), \(P\wedge Q\), and logical assertions (implicitly over empty heaps). The semantics is given by \(S, M, H \models A\) for stack \(S\), store \(M\), heap fragment \(H\), and assertion \(H\). The Hoare rules specific to separation logic constructs are:

1. \(\vdash \{ \mathit{acc}(x)\} x[i] := y; \{x[i] \mapsto y\}\)
2. \(\vdash \{ x[i] \mapsto z \} y := x[i]; \{ x[i] \mapsto z * y == z \}\)
3. \(\vdash \{ emp\} x := new T; \{\textit{acc}(x)\}\)
4. \(\vdash \{ \mathit{acc}(x) \} \mathit{free}(x); \{ emp \}\)

Prove these rules sound with respect to semantics. One tricky aspect of the formalization is the state. The easiest way to do this is to employ the de Bruijn representation so that each variable is numbered by its position from the top of the stack. The value type is a disjoint union between integers and references. The type of references is also just the natural numbers (just so we have an unbounded supply of references). Modeling the right-hand side expression of an assignment is another challenge. It is best to view this as some function of the state. The left-hand side of an assignment is either a variable or a dereference.

** MaxSeg Sum (Medium)

The Speaking Logic lectures contain a treatment of the maximum segment sum problem. Do your own definition of the algorithm and construct a proof for it.

** Sorting Algorithms (Medium)

Verify Bubblesort, insertion sort, Quicksort, Heapsort, and Mergesort. You have to show that the output is a ordered permutation of the input. You can assume that the element type is =uint32=. You can additionally show that your algorithm is stable, i.e., it leaves sorted arrays unchanged. Of these, Heapsort might be the most challenging since you have to verify the reheap procedure.

** IF-Normalization (Easy)

IF-expressions can be defined by a datatype that has a constructor for IF-expressions with three accessors: condition, thenBranch, and elseBranch, and the truth values: True and False, and variables. An IF-expression is in normal form if the condition part of any IF-expression is always a variable, and there are no redundant IF-expressions of the form \(IF(x, A, A)\). Show that any IF-expression can be converted into normal form. Write a simplifier for normal-form IF-expressions so that no variable is repeated along any branch.

** BDD Construction (Hard)

Write a function that implements the Apply operation on BDDs. We have a table of \(V\) variables that returns an ordering on the variables, i.e., an injection from \(V\) to \(|V|\), and a BDD table \(T\) that maps each node \(N\) to \(\mathit{vars}(N)\), \(left(N)\) and \(right(N)\). Show that any satisfying assignment for the equalities in the new table \(T'\) is a satisfying assignment for the original table and the result of the Apply operation. Recall that the Apply operation applies \(\vee\) or \(\wedge\) to two BDDs. To compute \(M \odot N\), where \(M = ITE(x, M_1, M_2)\) and \(N = ITE(y, N_1, N_2)\) where \(x > y\), we compute \(MN = ITE(x, M_1 \odot N, M_2 \odot N)\). Otherwise, we just compute the \(\odot\) operations on the constants \(0\) and \(1\).

** Checker for RUP proofs (Medium)

The LRAT proof format for Reverse Unit Propagating (RUP) proofs requires lemma clauses \(C\) that are obtained from the input clauses and prior lemma clauses by Reverse Unit Propagation. This requires negating the literals in \(C\) and propagating the conjunction of these literals through the given clauses in order to derive new literals until the final clause is falsified. A RUP proof consists of a sequence of clause additions and deletions (which we ignore). The final lemma should be the empty clause which follows. Prove that RUP inference is sound. See Marijn Heule's lectures for details.

