problems.html

<div id="outline-container-orga2983cb" class="outline-3">
<h3 id="orga2983cb">Shortest Path Algorithm (Medium)</h3>
<div class="outline-text-3" id="text-orga2983cb">
<p>
Dijkstra&rsquo;s shortest path algorithm considers a directed graph with non-negative edge-weights and computes the shortest path from a source vertex to all of the vertices. Write and verify Dijkstra&rsquo;s algorithm. To make things a little more explicit, you are given a graph with \(N\) vertices (numbered \(0\) to \(N-1\)) and an \(N\times N\) edge matrix with non-negative (possibly \(\infty\)) weights, and a source vertex is \(s\). You are to construct an array \(P\) of the smallest path weight from \(s\) to each vertex \(t\). Each entry in \(P\) includes the index of a vertex, say \(t\), and the smallest path weight from \(s\) to \(t\). The \(P\) array is partitioned into a prefix with the dead vertices \(D\) and a suffix \(L\) of live vertices organized in a heap. An index \(i\) labels the location of the cursor separating \(D\) from \(L\). As noted in the Speaking Logic slides (117 and 118), the shortest path from \(s\) to any \(t\) is given by a vector \(P\) such that \(P(s) = 0\) and for any \(v\neq s\), \(P(v) = \mathit{min}_u (P(u) + W(u, v))\). For each vertex \(v\) in \(D\), \(P(v)\) is the shortest path. For each vertex \(v\) in \(L\), \(P(v)\) is the shortest path to \(v\) through an edge from \(D\). For the minimal vertex \(v\in L\), no path through an edge from a vertex \(u\) in \(L\) is going to be smaller than \(P(v)\). Hence \(v\) can be moved to \(D\) and the weights of the remaining vertices in \(L\) can be updated to maintain the invariant.
</p>
</div>
</div>

<div id="outline-container-orgf7b0dfd" class="outline-3">
<h3 id="orgf7b0dfd">Floyd&#x2013;Warshall Algorithm for All-Pairs Shortest Path (Hard)</h3>
<div class="outline-text-3" id="text-orgf7b0dfd">
<p>
Verify the Floyd&#x2013;Warshall algorithm by showing that it contains the shortest path between any two vertices in a weighted directed graph with that does not contain any negative cycles. Alternately, you can show that it computes the shortest cycle-free path. See <a href="https://en.wikipedia.org/wiki/Floyd_Warshall_algorithm">https://en.wikipedia.org/wiki/Floyd_Warshall_algorithm</a> for details.
</p>
</div>
</div>

<div id="outline-container-orge53ea99" class="outline-3">
<h3 id="orge53ea99">Model Checking BMP/8N1 protocols (Medium)</h3>
<div class="outline-text-3" id="text-orge53ea99">
<p>
Repeat the verification of these protocols by Brown and Pike (<a href="https://leepike.github.io/pub_pages/bmp.html">https://leepike.github.io/pub_pages/bmp.html</a>) using SAL.
</p>
</div>
</div>

<div id="outline-container-orgcea425d" class="outline-3">
<h3 id="orgcea425d">Soundness of Separation Hoare Logic (Medium)</h3>
<div class="outline-text-3" id="text-orgcea425d">
<p>
The 2022 lectures from Prof. Ruzica Piskac contain the proof rules and semantics for Separation Logic. Formalize the semantics of separation logic and prove that the rules are sound. If you are using a proof assistant, you have the choice of capturing the state of the computation as a mapping \(S\) of variables to (integer and reference) values, and the heap (store) \(M\) as mapping references to arrays containing (integer or reference) values. A heap fragment is just a (possibly empty) subset of references in the domain of the heap. To model separating conjunction \(P * Q\) over a heap fragment \(H\), you need to partition \(H\) into \(H_1\) and \(H_2\) so that \(P\) is an assertion over heap fragment \(H_1\) and \(Q\) is over heap fragment \(H_2\). Recall that the assertions are of the form \(\textit{acc}(r)\), \(P * Q\), \(P\wedge Q\), and logical assertions (implicitly over empty heaps). The semantics is given by \(S, M, H \models A\) for stack \(S\), store \(M\), heap fragment \(H\), and assertion \(H\). The Hoare rules specific to separation logic constructs are:
</p>

<ol class="org-ol">
<li>\(\vdash \{ \mathit{acc}(x)\} x[i] := y; \{x[i] \mapsto y\}\)</li>
<li>\(\vdash \{ x[i] \mapsto z \} y := x[i]; \{ x[i] \mapsto z * y == z \}\)</li>
<li>\(\vdash \{ emp\} x := new T; \{\textit{acc}(x)\}\)</li>
<li>\(\vdash \{ \mathit{acc}(x) \} \mathit{free}(x); \{ emp \}\)</li>
</ol>

<p>
Prove these rules sound with respect to semantics. One tricky aspect of the formalization is the state. The easiest way to do this is to employ the de Bruijn representation so that each variable is numbered by its position from the top of the stack. The value type is a disjoint union between integers and references. The type of references is also just the natural numbers (just so we have an unbounded supply of references). Modeling the right-hand side expression of an assignment is another challenge. It is best to view this as some function of the state. The left-hand side of an assignment is either a variable or a dereference.
</p>
</div>
</div>

<div id="outline-container-orgc7eecbc" class="outline-3">
<h3 id="orgc7eecbc">MaxSeg Sum (Medium)</h3>
<div class="outline-text-3" id="text-orgc7eecbc">
<p>
The Speaking Logic lectures contain a treatment of the maximum segment sum problem. Do your own definition of the algorithm and construct a proof for it.
</p>
</div>
</div>

<div id="outline-container-org9bae798" class="outline-3">
<h3 id="org9bae798">Sorting Algorithms (Medium)</h3>
<div class="outline-text-3" id="text-org9bae798">
<p>
Verify Bubblesort, insertion sort, Quicksort, Heapsort, and Mergesort. You have to show that the output is a ordered permutation of the input. You can assume that the element type is <code>uint32</code>. You can additionally show that your algorithm is stable, i.e., it leaves sorted arrays unchanged. Of these, Heapsort might be the most challenging since you have to verify the reheap procedure.
</p>
</div>
</div>

<div id="outline-container-org71eee25" class="outline-3">
<h3 id="org71eee25">IF-Normalization (Easy)</h3>
<div class="outline-text-3" id="text-org71eee25">
<p>
IF-expressions can be defined by a datatype that has a constructor for IF-expressions with three accessors: condition, thenBranch, and elseBranch, and the truth values: True and False, and variables. An IF-expression is in normal form if the condition part of any IF-expression is always a variable, and there are no redundant IF-expressions of the form \(IF(x, A, A)\). Show that any IF-expression can be converted into normal form. Write a simplifier for normal-form IF-expressions so that no variable is repeated along any branch.
</p>
</div>
</div>

<div id="outline-container-org7156599" class="outline-3">
<h3 id="org7156599">BDD Construction (Hard)</h3>
<div class="outline-text-3" id="text-org7156599">
<p>
Write a function that implements the Apply operation on BDDs. We have a table of \(V\) variables that returns an ordering on the variables, i.e., an injection from \(V\) to \(|V|\), and a BDD table \(T\) that maps each node \(N\) to \(\mathit{vars}(N)\), \(left(N)\) and \(right(N)\). Show that any satisfying assignment for the equalities in the new table \(T'\) is a satisfying assignment for the original table and the result of the Apply operation. Recall that the Apply operation applies \(\vee\) or \(\wedge\) to two BDDs. To compute \(M \odot N\), where \(M = ITE(x, M_1, M_2)\) and \(N = ITE(y, N_1, N_2)\) where \(x > y\), we compute \(MN = ITE(x, M_1 \odot N, M_2 \odot N)\). Otherwise, we just compute the \(\odot\) operations on the constants \(0\) and \(1\).
</p>
</div>
</div>

<div id="outline-container-org827027f" class="outline-3">
<h3 id="org827027f">Checker for RUP proofs (Medium)</h3>
<div class="outline-text-3" id="text-org827027f">
<p>
The LRAT proof format for Reverse Unit Propagating (RUP) proofs requires lemma clauses \(C\) that are obtained from the input clauses and prior lemma clauses by Reverse Unit Propagation. This requires negating the literals in \(C\) and propagating the conjunction of these literals through the given clauses in order to derive new literals until the final clause is falsified. A RUP proof consists of a sequence of clause additions and deletions (which we ignore). The final lemma should be the empty clause which follows. Prove that RUP inference is sound. See Marijn Heule&rsquo;s lectures for details.
</p>
</div>
</div>
