problems.org
** Checking Stratification

The problem of stratification came up in the lectures on Datalog. Negation and aggregation can only be applied to predicates in a prior stratum. For this to work, the dependencies between predicates have to be stratified. Given a dependency matrix, can you check that the graph is stratified. The dependency matrix shows whether a predicate depends positively or negatively on another predicate so that \(D_{ij}\) is \(0\) if the predicate \(i\) depends on predicate \(j\) positively, and \(1\) if it depends negatively, and \(-1\), otherwise. Check that a dependency matrix is stratified. This could be done by generating inequalities \(x_j + D_{ij} \leq x_j\), if \(D_{ij} \geq 0\). Any solution for this system of inequalities would yield a stratification of the predicates so that no predicate depends on itself through one or more negations.

** Simple Concurrency Problem

This problem comes from Andreas Podelski (who got it from a student). You have a fixed but unspecified number of threads =numthreads=. Each thread executes the following steps in an unbounded loop:

#+BEGIN_SRC text
while * do
  if global + numthreads > maxint
    then skip
    else local = global; global++;
  assert global > local
#+END_SRC

Check if the above program has a race condition. Fix the problems if any by adding atomicity annotations. Prove that the assertion is maintained and that never triggers an arithmetic overflow. Be careful, this problem might not be as simple as it appears.

** Brzozowski Derivatives

Look at the Generalized Regular Expression (GRE) formalism described in [[https://en.wikipedia.org/wiki/Brzozowski_derivative]]. Define the syntax and semantics of GREs. Define a function that takes the derivative \(\sigma^{-1}R\) of a GRE \(R\) relative to a token. Define the iterated version that operates over a string, and show that a string \(\rho\) is accepted by a regular expression exactly when \(\varepsilon\in \rho^{-1}R\).

** Two-Process Bakery Algorithm using Predicate Abstraction

The algorithm consists of two processes \(P\) and \(Q\) with control variables \(pcp\) and \(pcq\), respectively, and shared variables \({x}\) and \({ y}\). The control states of these processes are either \(\mathtt{sleeping}\), \(\mathtt{trying}\), or \(\mathtt{critical}\). Initially, \({ pcp}\) and \({ pcq}\) are both set to \(\mathtt{sleeping}\) and the control variables satisfy \({ x} = { y} = 0\). The transitions for \(P\) are

\[
\begin{array}{crl}
& {\tt pcp} = sleeping \longrightarrow &{ x'} = { y} + 1;\ {pcp'} = {\tt trying} \\
\mathtt{[]}
& { pcp} = {\tt trying} \wedge ( { y} = 0 \vee  { x} < { y})
\longrightarrow & { pcp'} = {\tt critical} \\
\mathtt{[]}
& {pcp} = {\tt critical} \longrightarrow & {x'} = 0;\ {\tt pcp'} = {\tt sleeping}
\end{array}
\]

Similarly, the transitions for \(Q\) are

\[
\begin{array}{crl}
& { pcq} = {\tt sleeping} \longrightarrow  & { y'} = { x} + 1;\ {pcq'} = {\tt trying}\\
\mathtt{[]}
& { pcq} = {\tt trying} \wedge ( { x} = 0 \vee  { y} \leq { x})
\longrightarrow & { pc'} = {\tt critical} \\
\mathtt{[]}
& { pcq} = {\tt critical} \longrightarrow & { y'} = 0;\ { pcq'} = {\tt sleeping}
\end{array}
\]

Establish for \(P\mathop{\mathtt{[]}} Q\), the interleaving composition of \(P\) and \(Q\), the invariant \(\neg ({ pcp} = {\tt critical} \wedge { pcq} = {\tt critical}\).

** Interval Analysis by Abstract Interpretation

The interval domain consists of intervals of the form \([l, u]\), where \(l\) and \(u\) range over the extended integers. Given a program that operates on integer variables \(x\), \(y\), etc., your analysis should return a sound approximation of the interval ranges for each variable at each program point. You can assume that you have a program defined on the integer variables:

1. Using addition and subtraction
2. \(\mathbf{assume}\ b\), where condition \(b\) is an equality or inequality comparisons between variables or between variables and constants
3. Iteration \(S^*\), where the exit condition is an equality/inequality comparison
4. Choice \(S_1 \mathtt{[]} S_2\)
5. Sequencing \(S_1 ; S_2\)

- Construct a transfer function from intervals to intervals for the operators \(+\) and \(-\).
- Construct a transfer function for statements from an abstract state to an abstract state.
- Define a widening operation \(\nabla\), where \(I_1 \nabla I_2\) returns an interval such that \(I_1\sqsubseteq I\) and \(I_2 \sqsubseteq I\) so that there are no infinite increasing chains of widenings.
- Implement an abstract interpreter.
- Bonus: Prove that the abstract intepreter is sound.
