problems.html

<div id="outline-container-orgea8c107" class="outline-3">
<h3 id="orgea8c107">Checking Stratification</h3>
<div class="outline-text-3" id="text-orgea8c107">
<p>
The problem of stratification came up in the lectures on Datalog. Negation and aggregation can only be applied to predicates in a prior stratum. For this to work, the dependencies between predicates have to be stratified. Given a dependency matrix, can you check that the graph is stratified. The dependency matrix shows whether a predicate depends positively or negatively on another predicate so that \(D_{ij}\) is \(0\) if the predicate \(i\) depends on predicate \(j\) positively, and \(1\) if it depends negatively, and \(-1\), otherwise. Check that a dependency matrix is stratified. This could be done by generating inequalities \(x_j + D_{ij} \leq x_j\), if \(D_{ij} \geq 0\). Any solution for this system of inequalities would yield a stratification of the predicates so that no predicate depends on itself through one or more negations.
</p>
</div>
</div>

<div id="outline-container-org360b200" class="outline-3">
<h3 id="org360b200">Simple Concurrency Problem</h3>
<div class="outline-text-3" id="text-org360b200">
<p>
This problem comes from Andreas Podelski (who got it from a student). You have a fixed but unspecified number of threads <code>numthreads</code>. Each thread executes the following steps in an unbounded loop:
</p>

<div class="org-src-container">
<pre class="src src-text">while * do
  if global + numthreads &gt; maxint
    then skip
    else local = global; global++;
  assert global &gt; local
</pre>
</div>

<p>
Check if the above program has a race condition. Fix the problems if any by adding atomicity annotations. Prove that the assertion is maintained and that never triggers an arithmetic overflow. Be careful, this problem might not be as simple as it appears.
</p>
</div>
</div>

<div id="outline-container-org1727a5a" class="outline-3">
<h3 id="org1727a5a">Brzozowski Derivatives</h3>
<div class="outline-text-3" id="text-org1727a5a">
<p>
Look at the Generalized Regular Expression (GRE) formalism described in <a href="https://en.wikipedia.org/wiki/Brzozowski_derivative">https://en.wikipedia.org/wiki/Brzozowski_derivative</a>. Define the syntax and semantics of GREs. Define a function that takes the derivative \(\sigma^{-1}R\) of a GRE \(R\) relative to a token. Define the iterated version that operates over a string, and show that a string \(\rho\) is accepted by a regular expression exactly when \(\varepsilon\in \rho^{-1}R\).
</p>
</div>
</div>

<div id="outline-container-org5b676be" class="outline-3">
<h3 id="org5b676be">Two-Process Bakery Algorithm using Predicate Abstraction</h3>
<div class="outline-text-3" id="text-org5b676be">
<p>
The algorithm consists of two processes \(P\) and \(Q\) with control variables \(pcp\) and \(pcq\), respectively, and shared variables \({x}\) and \({ y}\). The control states of these processes are either \(\mathtt{sleeping}\), \(\mathtt{trying}\), or \(\mathtt{critical}\). Initially, \({ pcp}\) and \({ pcq}\) are both set to \(\mathtt{sleeping}\) and the control variables satisfy \({ x} = { y} = 0\). The transitions for \(P\) are
</p>

<p>
\[
</p>
\begin{array}{crl}
& {\tt pcp} = sleeping \longrightarrow &{ x'} = { y} + 1;\ {pcp'} = {\tt trying} \\
\mathtt{[]}
& { pcp} = {\tt trying} \wedge ( { y} = 0 \vee  { x} < { y})
\longrightarrow & { pcp'} = {\tt critical} \\
\mathtt{[]}
& {pcp} = {\tt critical} \longrightarrow & {x'} = 0;\ {\tt pcp'} = {\tt sleeping}
\end{array}
<p>
\]
</p>

<p>
Similarly, the transitions for \(Q\) are
</p>

<p>
\[
</p>
\begin{array}{crl}
& { pcq} = {\tt sleeping} \longrightarrow  & { y'} = { x} + 1;\ {pcq'} = {\tt trying}\\
\mathtt{[]}
& { pcq} = {\tt trying} \wedge ( { x} = 0 \vee  { y} \leq { x})
\longrightarrow & { pc'} = {\tt critical} \\
\mathtt{[]}
& { pcq} = {\tt critical} \longrightarrow & { y'} = 0;\ { pcq'} = {\tt sleeping}
\end{array}
<p>
\]
</p>

<p>
Establish for \(P\mathop{\mathtt{[]}} Q\), the interleaving composition of \(P\) and \(Q\), the invariant \(\neg ({ pcp} = {\tt critical} \wedge { pcq} = {\tt critical}\).
</p>
</div>
</div>

<div id="outline-container-orge402e0f" class="outline-3">
<h3 id="orge402e0f">Interval Analysis by Abstract Interpretation</h3>
<div class="outline-text-3" id="text-orge402e0f">
<p>
The interval domain consists of intervals of the form \([l, u]\), where \(l\) and \(u\) range over the extended integers. Given a program that operates on integer variables \(x\), \(y\), etc., your analysis should return a sound approximation of the interval ranges for each variable at each program point. You can assume that you have a program defined on the integer variables:
</p>

<ol class="org-ol">
<li>Using addition and subtraction</li>
<li>\(\mathbf{assume}\ b\), where condition \(b\) is an equality or inequality comparisons between variables or between variables and constants</li>
<li>Iteration \(S^*\), where the exit condition is an equality/inequality comparison</li>
<li>Choice \(S_1 \mathtt{[]} S_2\)</li>
<li>Sequencing \(S_1 ; S_2\)</li>

<li>Construct a transfer function from intervals to intervals for the operators \(+\) and \(-\).</li>
<li>Construct a transfer function for statements from an abstract state to an abstract state.</li>
<li>Define a widening operation \(\nabla\), where \(I_1 \nabla I_2\) returns an interval such that \(I_1\sqsubseteq I\) and \(I_2 \sqsubseteq I\) so that there are no infinite increasing chains of widenings.</li>
<li>Implement an abstract interpreter.</li>
<li>Bonus: Prove that the abstract intepreter is sound.</li>
</ol>
</div>
</div>
</div>
</main>
</body>
</html>
